# GetValueAsDoubles Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDoubleArray3d..::..GetValueAsDoubles Method
AssetPropertyDoubleArray3d Class See Also
---
Get the value property as doubles.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<double> GetValueAsDoubles()
```

Visual Basic
---
```text
Public Function GetValueAsDoubles As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetValueAsDoubles()
```

# See Also
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace